app/views/landmarks/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."landmark_id" = $1  [["landmark_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."landmark_id" = $1  [["landmark_id", 2]]
---

<% if @landmark.posts.count == 0 %>