app/controllers/landmarks_controller.rb

SELECT "landmarks".* FROM "landmarks"
---
  def index
    @landmarks = Landmark.all

SELECT  "landmarks".* FROM "landmarks" WHERE "landmarks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @landmark = Landmark.find(params[:id])