app/controllers/neighborhoods_controller.rb

  def index
    @neighborhoods = Neighborhood.all
---
SELECT "neighborhoods".* FROM "neighborhoods"

  def show
    @neighborhoods = Neighborhood.find(params[:id])
---
SELECT  "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" = $1 LIMIT $2  [["id", 49], ["LIMIT", 1]]