app/controllers/posts_controller.rb

  def new
    @landmark = Landmark.find(params[:landmark_id])
---
SELECT  "landmarks".* FROM "landmarks" WHERE "landmarks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @landmark = Landmark.find(params[:landmark_id])
---
SELECT  "landmarks".* FROM "landmarks" WHERE "landmarks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def show
    @landmark = Landmark.find(params[:landmark_id])
    @post = @landmark.posts.find(params[:id])
---
SELECT  "landmarks".* FROM "landmarks" WHERE "landmarks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."landmark_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["landmark_id", 1], ["id", 1], ["LIMIT", 1]]

  def edit
    @landmark = Landmark.find(params[:landmark_id])
    @post = @landmark.posts.find(params[:id])
---
SELECT  "landmarks".* FROM "landmarks" WHERE "landmarks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."landmark_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["landmark_id", 1], ["id", 1], ["LIMIT", 1]]

  def update
    @landmark = Landmark.find(params[:landmark_id])
    @post = @landmark.posts.find(params[:id])
---
SELECT  "landmarks".* FROM "landmarks" WHERE "landmarks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."landmark_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["landmark_id", 3], ["id", 4], ["LIMIT", 1]]

  def destroy
    @landmark = Landmark.find(params[:landmark_id])
    @post = @landmark.posts.find(params[:id])
---
SELECT  "landmarks".* FROM "landmarks" WHERE "landmarks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."landmark_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["landmark_id", 3], ["id", 2], ["LIMIT", 1]]