app/controllers/posts_controller.rb

  def new
    @neighborhood = Neighborhood.find(params[:neighborhood_id])
---
SELECT  "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def create
    @neighborhood = Neighborhood.find(params[:neighborhood_id])
    @post = @neighborhood.posts.create(post_params.merge(user: current_user))
---
SELECT  "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "posts" ("author", "title", "photo_url", "content", "inquiry_type", "location", "neighborhood_id", "created_at", "updated_at", "user_id", "latitude", "longitude") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def show
    @neighborhood = Neighborhood.find(params[:neighborhood_id])
    @post = @neighborhood.posts.find(params[:id])
---
SELECT  "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."neighborhood_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["neighborhood_id", 6], ["id", 1], ["LIMIT", 1]]

  def edit
    @neighborhood = Neighborhood.find(params[:neighborhood_id])
    @post = @neighborhood.posts.find(params[:id])
---
SELECT  "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."neighborhood_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["neighborhood_id", 6], ["id", 1], ["LIMIT", 1]]

  def update
    @neighborhood = Neighborhood.find(params[:neighborhood_id])
    @post = @neighborhood.posts.find(params[:id])
    if @post.user == current_user
      @post.update(post_params)
---
SELECT  "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."neighborhood_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["neighborhood_id", 6], ["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "location" = $1, "inquiry_type" = $2, "latitude" = $3, "longitude" = $4, "updated_at" = $5 WHERE "posts"."id" = $6  [["location", "nowhere"], ["inquiry_type", "accessibility"], ["latitude", 35.1592256], ["longitude", -98.4422802], ["updated_at", "2018-01-24 19:07:01.680875"], ["id", 6]]

  def destroy
    @neighborhood = Neighborhood.find(params[:neighborhood_id])
    @post = @neighborhood.posts.find(params[:id])
    if @post.user == current_user
      @post.destroy
---
SELECT  "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."neighborhood_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["neighborhood_id", 6], ["id", 5], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 2]]