app/views/neighborhoods/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."neighborhood_id" = $1  [["neighborhood_id", 6]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."neighborhood_id" = $1  [["neighborhood_id", 49]]
---
    <h3>
      <% if @neighborhood.posts.count == 0 %>